import {
  FaRedoAlt,
  FaSeedling,
  FaDumbbell,
  FaCog,
  FaRunning,
  FaBullseye,
  FaBuilding,
  FaRocket,
  FaStar,
  FaTrophy,
  FaFlagCheckered,
} from "react-icons/fa";

export const SAYS = [
  {
    score: 0,
    message:
      "لم تبدأ بعد، ولكن لا بأس. الرحلة تبدأ بخطوة، وخطوتك الأولى قد تكون الآن. لا تؤجل، وابدأ ببساطة دون ضغط.",
    icon: FaRedoAlt,
  },
  {
    score: 10,
    message:
      "بداية متواضعة، لكنها البداية الأهم. لا تقلل من قيمة هذه الخطوات الصغيرة، فهي من تصنع الفرق على المدى البعيد.",
    icon: FaSeedling,
  },
  {
    score: 20,
    message:
      "جميل، بدأت تتحرك. التكرار والممارسة أهم من النتيجة الآن. كل محاولة تزيدك فهماً وقوة.",
    icon: FaDumbbell,
  },
  {
    score: 30,
    message:
      "أنت تبني عادة وتكتسب مهارة. التقدم الحقيقي لا يُقاس بالنقاط فقط، بل بالثبات والمثابرة.",
    icon: FaCog,
  },
  {
    score: 40,
    message:
      "اقتربت من النصف، وتثبت لنفسك أنك قادر. قد تشعر بالتعب أو الشك، لكن لا تنسَ لماذا بدأت.",
    icon: FaRunning,
  },
  {
    score: 50,
    message:
      "منتصف الطريق! هذا هو الوقت الذي ينسحب فيه البعض، لكنك مختلف. خذ نفسًا عميقًا، وأكمل بقوة.",
    icon: FaBullseye,
  },
  {
    score: 60,
    message:
      "عظيم يا صديقي.. أداءك في الكورس ده أفضل من 60% من باقي الطلبة.. كمّل عايز أشوف اسمك في الليدر بورد هنا",
    icon: FaBuilding,
  },
  {
    score: 70,
    message:
      "أداء رائع! هذا المستوى يعكس انضباطك وفهمك. حافظ على هذا الاتزان، وكن صبورًا على النتائج الكبيرة.",
    icon: FaRocket,
  },
  {
    score: 80,
    message:
      "الآن تظهر نتائج الجهد الحقيقي. عملك يتحدث عنك، وثقتك بنفسك تبدأ بالنمو. لا تتوقف الآن.",
    icon: FaStar,
  },
  {
    score: 90,
    message:
      "اقتربت من القمة، وهذه اللحظات تتطلب التركيز وليس الاستعجال. كل نقطة إضافية تعني نضجًا وتفوقًا.",
    icon: FaTrophy,
  },
  {
    score: 100,
    message:
      "لقد أتممت المهمة بنجاح كامل! لكن الإنجاز الحقيقي هو أنك أثبت لنفسك أنك قادر. لا تنظر لهذه كنهاية، بل كبداية لمستوى جديد.",
    icon: FaFlagCheckered,
  },
];
